"
"All
"Although
"As
"G'
"In
"J"
"L"
"Operation
"We
"some
"to
"with
$
%
&
'
'4'
'A'
'Army'
'Army'.
'B'
'C'
'D'
'DEPOT'
'E'
'F'
'G'
'H'
'J'
'K'
'L'
'M'
'N'
'One'
'S
'Sharan
'crack
'd
'll
'm
're
's
've
(
(2nd
(3rd
(6)
(ABUTH),
(AFISMA)
(AFISMA).
(AHQG),
(ALFS)
(ARMY
(Abeokuta
(Abia
(Adamawa
(Admin/Logistics)
(Administration)
(Air
(Airborne
(Airborne)
(Akwa
(Amphibious)
(Anambra
(Area
(Army),
(Army).
(Awka,
(Bauchi
(Bayelsa
(Benue
(Borno
(Borno)
(CAOS),
(CASE)
(CASE).
(CDS),
(CIMIC)
(CJTF)
(CNS),
(COAS)
(COAS),
(COLOG)
(CSSS)
(CTOP)
(CTOP),
(Commanders)
(Cross
(D
(DAPR),
(DATOPS),
(DHQ),
(DHQ);
(DICON),
(DLS).
(DMI)
(DMI).
(DPO)
(DSP),
(DSS),
(Daura)
(Delta
(ECOWAS)
(Ebonyi
(Edo
(Ekiti
(Ekwulobia)
(Enugu
(FCT)
(Federal
(GOC)
(GOC),
(GOCs),
(General
(Gombe
(IED)
(IEDs)
(IGP),
(Imo
(JTF
(JTF)
(JTF),
(Jigawa
(Kaduna
(Kano
(Katsina
(Kebbi
(Kogi
(Kwara
(L),
(Lagos
(MNJTF)
(Monday).
(NA),
(NAAC)
(NACA),
(NACOL).
(NAF)
(NAFC)
(NAN)
(NAPKC),
(NAPTIP)
(NATRAC),
(NAWLG).
(NDC)
(NIBATT)36
(NURTW),
(NWCN)
(Nasarawa
(Navy)
(Niger
(Nnewi,
(Ogun
(Ondo
(Onitsha,
(Operation
(Operations
(Osun
(Otukpo,
(Oyo
(PMF)
(PPRO)
(Plateau
(Rear)
(Reccee
(Rivers
(RoE)
(Rule
(SARS)
(SBS)
(SP)
(STF
(STF)
(STF),
(Sokoto
(State
(TRADOC)
(TRADOC),
(Taraba
(UNAMID)
(UNMIL)
(UNMIL);
(Umuahia,
(Uyo,
(WACSOF)
(West),
(Yobe
(Zamfara
(arm
(operation
(rtd)
(rtd),
(today)
)
*
*Name
*Note
+
+27
+31
+33
+331
+358
+361
+381
+44
+48
+49
+525
+6221
+65
+6613377
+7095
,
-
--
---
---------------------
--------------------------------
----------------------------------
-Egba
.
..
...
....
...and
.01
.02
.10
.307
.357
.359
.362
.402
.405
.406
.408
.411
.423
.425
.426
.430
.434
.435
.439
.447
.450
.454
.456
.461
.462
.463
.465
.466
.467
.469
.470
.473
.474
.477
.492
.496
.500
.504
.508
.512
.515
.516
.519
.523
.526
.527
.530
.531
.534
.535
.537
.538
.542
.543
.545
.547
.551
.569
.573
.574
.578
.589
.592
.595
.604
.610
.628
.633
.recent
/
/CEO
0
0*
0-0
0-1
0-2
0-50
0.
0.05
0.08
0.10
0.12
0.15
0.2
0.20
0.25
0.27
0.3
0.33
0.38
0.4
0.4-0-9-0
0.40
0.45
0.46
0.47
0.48
0.5
0.50
0.55
0.60
0.63
0.73
0.75
0.79
0.8
0.85
0.94
0.95
00--44-171-542-7947
000
000s
0120
0172
02.SEP.96-06.MAR.97
0300
0330
04
0400
05/01/97
0645
08/23/96
08/26/96
08/28/96
08/29/1996
0800
09/01/96
09/04/96
0915
0:04
0:06
0:07
0:08
0:09
0:10
1
1,
1,000
1,002
1,003
1,037
1,041
1,044
1,143
1,328
1,380
1,400
1,421.90
1,429
1,452-km
1,500
1,600
1,700-hectare
1,750-hectare
1,803
1-0
1-1
1-1/2
1-1/3
1-106
1-15
1-16
1-3/4
1-48
1-6
1-7
1-96
1-for-2
1-mth
1.
1.0
1.000
1.03
1.126
1.16
1.19
1.2
1.20
1.206
1.33
1.38
1.43
1.4788
1.4789
1.5
1.50
1.55
1.6
1.7
1.8
1.80
1.84
1.90
1/2
10
10,
10,000
10-0-53-3
10-1-47-2
10-1-50-1
10-15
10-3-30-0
10-day
10-game
10-session
10-year
10-year-old
10.
10.0
10.10
10.11
10.13
10.18
10.28
10.43
10.45
10.6
10/01
100
100,000
100.6
1000
100no
101
101-member
101.40
102
1021
103
1036.575
104
104040
1045.56
105
106
106.5
1060.00
107
107.0
107.55
107.74
10700
10752.092
10772
108
108.9
109
109.4
10PMF
10no
10th
11
11,244
11,500
11,525
11,900-12,100
11-2
11-7
11-8
11.
11.0
11.00
11.12
11.34
11.53
11.60
11.61
110
110.50
110th
111
111.50
111th
112
112.56
112.8
112th-ranked
113
11361.330
115
117
117.9
118
118.8
119
11PMF
11th
11th-seeded
12
12,600-12,750
12,700-12,800
12,700-12,850
12,700-12,900
12,700-12,950
12,750-12,850
12,750-12,900
12,750-12,950
12,800-13,000
12,850-13,050
12,900-13,100
12,900-13,150
12-11
12-15
12-7
12-mth
12-year-old
12.
12.0
12.10
12.19
12.3
12.5
12.50
12.9
120
120,000
120.5
1200
121
122.5
123,394
124
12407
125
125M
127
127.10
127.3
128
128-4
128-member
128.6
129
12:01
12:30
12:30p.m.
12PMF
12pct
12th
13
13,
13,000
13,500
13-0
13-15
13-8
13-9
13-month-old
13-year-old
13.
13.0
13.18
13.4
13.42
13.45
13.80
130
130.2
1300
131
131.7
133
134
1345
135-9
1360
13607
137
138
1381
139.3
13935
13th
14
14,
14,000
14-17
14-9
14-day
14-month
14-pct
14.
14.12
14.16
14.4
140
141
142
142-4
142.3
143
143.60
143km
143rd
144
144.5
14432
1445
145
146
148
149
14PMF
14th
15
15,286
15,400
15-1
15-10
15-11
15-12
15-14
15-21
15-3
15-4
15-5
15-6
15-7
15-8
15-9
15-hour
15-year-old
15.
15.00
15.125
15.4-1-67-3
15.75
150
150.3
15000
151
152
153
154
155
156
156,996
156.00
157
1578
158
159
15PMF
15th
16
16,
16,668,560
16-2
16-6
16-year-old
16.
16.00
16.13
16.50
16.66
160
160-200
161
162
162-4
1626
1631
164
164-4
16408.700
1642
1646
165
165,150
165M
1673
1687
16:34
16PMF
16th
17
17,
17-
17-14
17-16
17.
17.4
170
170,952
171
171.00
172,580
173
174
176
177
178
179.5p
1791
17PMF
17th
18
18,000
18,867
18-18
18-3-55-1
18-7/8
18-man
18-year-old
18.
18.0
18.40
18.5
180
1803
181
181,005
1820
1844
1860
186th-ranked
187
1873
188
188,143
18:00
18:28
18th
19
19.
190
1900
1909
1912
1915.00
1918
192
192,
1926
193
1935
1940
1947
1948
1949
195
195,000
1951
1957.
1958
1960
1966
1967
1968
1971
1972
1973
1974
1975
1976
1978
1979
1981
1983
198354.941
1986
1986-87
1987
1988
1989
199
1990
1990-95
1990s
1991
1991-1786
1992
1992-95
1993
1994
1994-95
1995
1996
1996-08-23
1996-08-24
1996-08-25
1996-08-26
1996-08-27
1996-08-28
1997
1998
1998C
1998D
1999
19999.777
19BN
19th
1:45.24
1:45.62
1:46.09
1=35.73
1ST
1nb
1st
1w
2
2,000
2,017.99
2,074
2,282nd
2,337
2,341
2,341.5
2,342.0
2,342.00
2,383
2,455
2,558.84
2,616
2-0
2-0-18-0
2-1
2-1-4-0
2-1/2
2-136
2-16
2-2
2-239
2-6
2-92
2-mth
2.
2.0
2.00-2.25
2.1
2.11
2.15
2.19
2.2
2.20
2.3
2.4
2.40
2.43
2.5
2.50
2.50-3.0
2.6
2.75
2.9
2/32
20
20,000
20-6
20-man
20-month
20-month-old
20.
20.00
200
200,000
2000
20000.00
2001
2001,
2002
2003.
2005.
2008.
2009
2009,
201
2010.
2013
2013,
2013.
2015
2016
2017
2017.
2018
2018.
202
202,593
202.90
203
203.000
204
205-9
206
206,464
2060
2065.260
2067
207
207,990
208
208,978
208.442
209
209,412
2091
20PMF
20s
20th
21
21-Armoured
21-year-old
21.5
21.75
210
210,622
210,683
210.00
2103
211
211,175
212
212-859-1610
212-859-1650
2123
213
213,845
213,989
2130
214.40
2140.800
2151
2158
216-579-0077
2173
218.50
2183
21PMF
21st
22
22,
220
221
221st
222
222,457
223
2230
224,609
225-share
228
2288
229,360
22PMF
23
23,000-strong
23-3-112-0
23-5-71-1
230
231
231-7
232
232-km
2320.00
233
233,713
234
2361
2370.00
237km
2385
23PMF
23rd
24
24,800
24-year-old
24.50
24.8
241
2410
242
243
244
245
245,
246,077
246-248
2467.872
2470.00
248
2480
24th
25
25,000
25,860
25-
25-year-old
25.00
25.50
25.8
250
250,000
251
253,337
254
254,247
2562.094
257
258
25BN,
25PMF
25TH
26
26,
26-57
26-battalion
26-year-old
26.29
26.93
260
2609760
261
263
263-7
264
264.00
266
26PMF
26TH
26th
27
27,
27,500
27-year-old
27.
27.50
273
273-5
275
276-277
2778
279
27PMF
27TH
27th
28
28,000
28,000-student
28.
28.19
280
281
28PMF
28th
29
29,434
29,582
29-2/3
29-3-116-1
29.2
290,000
290.00
290M
291,088
293
295
297
298
29PMF
29th
2:00.39
2:00.91
2:37
2:42
2BN,
2BN,25BN,ECR,312BN,353BN
2nb
2nd
2w
3
3,
3,000
3,250,000
3,390,000
3,422
3,800-3,825
3,850
3,905.7
3,911
3-0
3-0-15-0
3-0-17-0
3-0-24-1
3-1
3-12
3-166
3-167
3-2
3-33
3-334
3-4
3-6
3-7
3-8/16
3-for-4
3-mth
3.
3.13
3.17
3.25-3.75
3.27
3.29
3.3
3.30
3.31
3.34
3.4
3.40
3.412
3.4210
3.4211
3.5
3.50-4.00
3.5486
3.55
3.56
3.7
3.70
3.73
3.75
3.8
3.85
3.87
3.89
3.9
3.92
3/1/90
3/4
30
30,000
30,300-30,400
30,700-30,800
30-SEPT
30-a-share
30-share
30-year
30-year-old
30.0
30.00
30.9
30.AUG.96
300
300-club
3000
300th
301
301,972
301ST
301st
302
3024.95
303
304
305
3050
307
3081
309
30PMF
30th
31
31,139
31.0
31.80
31.81
310
312
312-408-8720
312-408-8720--
312-408-8721
312-983-7347--
313
317
31PMF
31st
32
32,700-32,800
32,900-33,000
32-year-old
32.0
32.3
32.40
32.5
32.8
320
321
322
323
323-5
325
3250
326
32607.500
32PMF
32nd
33
33,230
33-26
33.0
330
330-member
331
333
334
335
335.00
3355.00
3359.200
336.47
337
339
339.00
33PMF
33rd
34
34.0
34.60
34.9
340.00
3404.71
341st
342
343
3432
344
345
34684
34PMF
35
35-year-old
35.0
350
351
353
3548
355
356
3565
357
357,000
357,143
359
359-2-84561
35PMF
35th
36
36,000
36-year-old
36.0
36.16
36.3
36.4
36.5
36.6
361
362
363
36337.137
365,000
366
369.66
36PMF
37
37-10-78-6
37-page
37.0
37.00
37.1-7-97-3
37.2
37.4
37.5
37.70
373-1800
374
375,000
375.00
376
377
37PMF
37th
38
38.0
38.00
38.1
38.43
38.5
38.50
382
383
3830.000
384-6364
384.00
385-1-4557075
388
388.55
388.75
389
38PMF
38th
39
39.0
39.2
391
391-seat
395
395.0
396
39721
398
39PMF
3:22
3nb
3rd
3w
4
4,153,800
4,200
4,200-acre
4,325-acre
4,464
4,500
4,570
4-
4-0
4-1
4-179
4-2
4-230
4-3
4-334
4-35
4-36
4-48
4-53
4-6
4-80
4-95
4-ounce
4-week
4.
4.0
4.00
4.05
4.09
4.10
4.2
4.20
4.3
4.30
4.4
4.41
4.46
4.5
4.50
4.5350
4.54
4.62
4.6200
4.7000
4.7200
4.7300
4.75
4.9
40
40,144
40-year-old
40.0
400
400,000
4000
4000.00
401
4017
403
405
406
407
408
408-8750
409
40PMF
41
41-5/16
41.0
41.5
413
416
419
41PMF
41no
41st
42
42-2-2423-0003
42.0
42.00
42.45
42.5
421
422.1
4221
4254
426
429,449
42PMF
43
43-month
43-year
43-year-old
43.0
431
432
434
435
439.9
43PMF
44
44-20
44.3
44.5
44.6
4411
445
446-9
447
448
44PMF
44th
45
45-46
45.00
45.15
450
455
456.8
45PMF
45th
46
46.16
46.21
460
462
469
46PMF
46th
47
47-10-116-2
47-38
47.2
47.4
4710.000
473
473-4746
473-6
476/698
47th
48
48,800
48-1
48-43
48-year-old
48.2
48.4
480,618
482-1003
483
487
49
49.16
49.67
49.7
49.83
4950.000
4PMF
4TH
4mos
4th
4yrs
5
5,000
5,700
5,731
5,800
5-
5-1
5-1-24-3
5-1/3
5-187
5-2
5-240
5-3
5-365
5-4
5-43
5-56
5-7
5-for-5
5.
5.0
5.00
5.05
5.06
5.13
5.15
5.1700
5.2
5.24
5.2420
5.2893
5.4
5.5
5.50
5.50-6.00
5.6
5.60
5.67
5.75
5.85
5/1/98-02
50
50,000-seat
50-day
500,000
5000
501
502
504
5040
5080815
50th-minute
51
51.00
51.80
51st
52
52-week
52.75
52.90
521
521-8
525
529-8
53
53,400
53-0
53.50
53.9
532-8
533153
53rd
54
542
5452
548
54th
55
55-11-2324411
55.1
55.66
55.99
5500
5511
555
556.19
5565
56
56.70
560
565
568
569
569399
57
57.02
57.2
57.44
57.50
571
575,000
576
57th
58
58.00
58.70
58.94
58.98
580,000
582
586
58th
59
59.00
59.33
59.50
593
59440
599
59th
5:17
5:30
5PMF
5th
6
6,000
6,045,000.00
6,310,000
6,425
6,500
6-
6-0
6-0-28-0
6-1
6-1-23-2
6-10
6-11
6-13
6-2
6-205
6-242
6-3
6-4
6-440
6-5
6-7
6-98
6-mth
6.
6.0
6.00
6.03
6.05
6.1
6.14900
6.3
6.30pm
6.4
6.48
6.5
6.5-8.5
6.64
6.65
6.72
6.9
6.96
6.98
60
60.00
60.33
600
600,000
6000
60000
60th
61
61-2
61.2
610
610,000
611
617-367-4106
6179
618
62
62.50
63
630.000
637.50
63rd
64
64.00
64.95
65
65-66
65.00
650,000
6510
653
65th
66
66-14
666
667
67
6700.00
6700.000
6736510
6777
68
68.80
680
681
685,000
69
69.00
69.5
69th
6PMF
6mth
7
7,
7,000
7,032
7,250
7,330,000
7-
7-0
7-0-24-2
7-0-35-0
7-1
7-1-24-0
7-100
7-15
7-2
7-2-11-0
7-2-13-1
7-2-24-1
7-220
7-263
7-3
7-4
7-5
7-502
7-6
7-9
7-pound
7.
7.0
7.03
7.2
7.3
7.35
7.40
7.5
7.85-8.15
7/17/2009
70
70,375,000
700
7000
702
70th
71
71.00
71.70
72
728-9559
728-9560
73
73.83
730
730,000
732.50
733.75
73rd
73th
74
74-0
740
743.50
745
74th
75
75,632
750
752.50
7546
758
758.75
75th
76
76.6
7658
767
77
775
77th
78
782.6
785.00
787.50
78th
79
79,390
79.00
79.20
79.9
7944
795
79th
7:51
7PMF
7pm
7th
8
8,
8,000
8,400
8,800
8-120
8-13
8-15
8-2/3
8-238
8-4
8-519
8-6
8-9
8.
8.0
8.00
8.1
8.2
8.20-8.50
8.25
8.30
8.32
8.4
8.5
8.50
8.9
80
80,000
80.70
800
800,000
80th
81
81-3
81.00
81.5
81.64
8167
81st
82
82.20
82.3
824
82nd
83
834405
837/763
83rd
84
84.20
840
84th
85
85.26
8520
853
859
85th
86
867.100
86th
87
87.5
870
8703080
8720--
88
88-year-old
89
89-86
89th
8PMF
8th
9
9,000
9,215,000.00
9,500
9,800
9-0-41-1
9-120
9-2
9-2-26-1
9-242
9-3
9-5
9-7
9-mth
9.
9.0-10.5
9.0-12.0
9.050
9.1
9.12
9.20-9.40
9.75
9/17/96
90
90-day
900.00
902
9074.850
90th
91
92
9221-5685192
93
93,
936.000
9373-1800
94.00
941
941-434319
941-8100
947
95
95.0
95.35
950
95975
96
96.0
96.00
960.00
97
97.00
97.5
9700
97674
98
98.00
98.4
98.9
99
9Brigade
9PMF
9th
:
;
=
?
@
A
A"
A$
A'
A.
A.B.
A.G.
A.H.
A.K.
A.O.
A.S.
A.T
A0
A1
A310
A380
A7E
AA
AA-
AB
ABA
ABABA
ABASI
ABC
ABEOKUTA—The
ABN-AMRO
ABUJA
ABUJA,
ABUJA-NIGERIA
ABUJA-THE
AC
ACADEMY
ACADEMY,
ACCOUNT
ACCTS
ACMD
ACTUAL
AD
AD-DIYAR
ADA
ADDIS
ADMINISTRATION
ADVANCE
ADVISER
AETSL
AEX
AFB,
AFCS
AFFAIRS
AFFAIRS,
AFFORD
AFISMA
AFISMA,
AFIT
AFIT,
AFL
AFP
AFRICA
AFRICAN
AFSS
AFTER
AG
AGAINST
AGBOWA
AGENCY
AGENCY,
AGENT
AGROTONZ
AHQ
AHRONOTH
AHT
AIG
AIR
AIRCRAFT
AIRES
AIRFORCE
AIRLIFT
AIRPORT
AJAX
AK
AK-47
AK47
AKINPELU
AKRAM
AKWA
AL
AL-ANWAR
AL-MUNTAR
AL-WATAN
ALAUSA
ALERT
ALLENTOWN
AM
AMC
AMERICAN
AMIS
AMMAN
AMMUNITION
AMOUNT
AMSTERDAM
AMT
AMTRAK
AN-NAHAR
ANALYSIS
ANC
AND
ANGELES
ANGELS
ANKARA
ANNEX
ANOTHER
ANP
AO
AOA
AOL
APA
APAPA
APAPA,
APC,
APPEAL
APPROVES
APRIL
AR
ARA
ARADU,
ARAKAN
ARC
AREA
ARF
ARGENTINE
ARMED
ARMORED
ARMOURED
ARMY
ARMY,
ARMY/HQ
ARTILLERY
ARTY
AS
AS-SAFIR
ASARCO
ASK
ASO
ASOKORO,
ASP
ASSEMBLY
ASWAQ
AT
ATAGI
ATHLETICS
ATIC
ATLANTA
ATLETICO
ATP
ATRIA
ATTACHÉ
ATTACK—Governor
AUCKLAND
AUG
AUGUST
AUSTRALIA
AUSTRALIAN
AUSTRIA
AUTHORITY
AUXERRE
AVENUE
AVERAGES
AVIA
AWAY
AZ
Aa3
Aalst
Aamir
Aarau
Aba
Ababa
Abagana
Abak
Abakaliki
Abakpa
Abasi
Abattoir
Abayi
Abayomi
Abba
Abbah
Abbah.
Abbah;
Abbey
Abbott
Abdukadir
Abdul
Abdul,
Abdul-Kadir
Abdul-Karim
Abdulkadir
Abdulkarim,
Abdullah
Abdullahi
Abdulmalik
Abejerin
Abejirin,
Abel
Abeokuta
Abeokuta,
Aberdeen
Abia
Abia,
Abigi
Abolurin,
Abortion
About
Abraham
Abraham,
Abu
Abubakar
Abubakar,
Abubakar.
Abubakar;
Abuj
Abuja
Abuja,
Abuja-Nigeria
Abuja.
Abuja;
Abyss
Academia
Academic
Academy
Academy,
Academy.
According
Account
Accountant
Accounting
Achall
Achalla
Achong
Achu-Olayi,
Ackerman
Acquisition
Acre
Act
Acting
Action
Activist
Actor
AdOn
Adaji
Adam
Adamawa
Adamawa.
Adams
Adams,
Adamu
Adani
Adatan
Addis
Addressing
Adebayo
Adefarati,
Adegboye
Adegboye,
Adejoh
Adekeye
Adekunle
Adelaide
Adele
Adeleke
Ademola
Adeniji
Adeniji-Adele
Adeniyi
Adeniyi,
Adenrele
Adeosun
Adeosun.
Aderanti
Aderanti,
Adeyemi
Adigbe
Adivsor,
Admin
Administratin
Administration
Administration,
Administration;
Administrator,
Admira
Admiral
Admirals
Admirals,
Adnan
Ado-Odo
Adoda
Adrian
Adriana
Adriatic
Advance
Advanced
Adviser
Adviser,
Advisers
Advisor
Aeoromedical
Aeromedical
Aeronautical
Afam
Affairs
Affairs,
Affairs;
AffairsMinistry
Afghan
Afghanistan
Afghans
Afikpo
Afolayan
Africa
Africa-Nigeria
African
African-Led
African-led
Africans
After
Agadir
Agassi
Agba
Agbado
Agbara
Agbedo
Agbedo,
Agbo
Agbonmwenma,
Agbowa
Agency
Agency,
Agent
Aggregate
Agha-Okoro
Agha-Okoro,
Ago-Iwoye
Agodi
Agota
Agrarian
Agriculture
Aguas
Aguata
Agugu
Agulu,
Ahanotu
Ahanotu,
Ahead
Ahmad
Ahmadu
Ahmed
Ahmed,
Ahoada
Ahronoth
Ai
Aides
Aiki
Aiki’
Air
AirLIFT
Airbus
Aircraft
Airdrieonians
Airende
Aires
Airforce
Airlift
Airlines
Airport
Airways
Ajah
Ajali
Ajalli
Ajalli,
Ajax
Ajegunle
Ajgin,
Ajingin
Ajuonu,
Ajuwon
Aka
Akam
Akanbi,
Akara
Akem
Akem,
Akeredolu
Aki
Akim
Akinjobi
Akinpelu
Akinwale,
Akinyemi,
Akodo
Akomolafe,
Akpan
Akpofure,
Akpor
Akram
Akron
Akukutoru
Akure
Akure,
Akwa
Akwa-Ibom
Akwanga
Al
Ala
Alade
Alagarno,
Alagbado
Alain
Alakara
Alakuko
Alalpere
Alamala,
Alami
Alan
Alaniya
Alapere
Alarm
Alastair
Alau
Alausa
Albania
Albanian
Albans
Alberta
Alberto
Albion
Alcan
Alcatel
Alec
Alejandro
Aleksander
Aleksandra
Alert
Alessandro
Alex
Alexander
Alexander,
Alexandra
Alexandre
Alexandrou
Alexia
Alfa
Alfred
Algeria
Alh.
Alhaji
Ali
Ali,
Ali.
Alistair
Aliyu
Aliyu,
Alkali
Alkali,
Alkmaar
All
All-Star
Allenby
Allensbach
Alleyne
Alli
Alli,
Alloa
Almost
Alomar
Alonso
Alphabet
Also
Also,
Alsthom
Alta
Altamira
Although
Alucasa
Aluminium
Aluminum
Aluu
Alvarado
Amanda
Amarizu,
Amawabia,
Ambassador
Ambrose
Amdaga
Amechi-Uwani
Ameers
America
American
American-style
Americans
Ames
Amica
Amichi
Amina
Amitai
Amman
Ammunition
Amnesty
Among
Amore,
Amount
Amour
Amoured
Amphibious
Amphibious)
Amr
Amrollah
Amsterdam
Amsterdam-Rotterdam
Amtrak
Amukoko
Amy
An
Ana
Anaku
Analysts
Anam
Anambra
Anaocha
Anaryu,
Anatoly
And
Anderlecht
Anders
Anderson
Andoni
Andre
Andrea
Andreas
Andrei
Andrejez
Andres
Andrew
Andy
Angbazo,
Angel
Angeles
Angeli
Angelica
Angelo
Angels
Ango,
Angola
Angwan-Rogo
Anis
Ankara
Anke
Ann
Anna
Annabel
Annan
Anne
Anne-Gaelle
Announcement
Announcing
Another
Anthony
Anti
Anti-Robbery
Anti-abortion
Anti-terrorists
Antioquia
Anton
Antonio
Antwerp
Anwar
Anxieties
Anyang
Anza
Ao
Apapa
Apapa,
Apata
Apertura
Apparel
Apparently
Appelmans
April
Arab
Araba
Arabia
Arabic
Arabised
Arabs
Arafat
Arantxa
Arase,
Arbroath
Archaeologists
Archbishop
Area
Area,
Area.
Areas
Arende
Arendt
Arequipa
Argentina
Argentine
Arges
Arguing
Ariahu,
Ariaria
Arlen
Armament
Armed
Arminia
Armored
Armour
Armoured
Armoury
Armstrong
Army
Army,
Army.
Army/Signals
Army;
Army’s
Arnaud
Arnaut
Arnhem
Arnold
Aron
Aronkasei
Around
Arrivals
Arsenal
Art
Arthur
Artillary
Artillery
Artillery,
Artmedia
Arum
Aryeh
As
Asa
Asa,
Asaba-Onitsha
Ashimiyu
Ashley
Ashoknagar
Ashta
Asia
Asian
Asif
Ask
Asked
Aslan
Asokoro
Asokoro,
Assembly
Assessment
Assistant
Association
Association,
Associations
Aston
Astros
Asutan
Asymmetric
At
Ata-ur-Rehman
Atagi
Ataki,
Atakpa
Atan
Atewe,
Atheist
Atherton
Athletics
Atlanta
Atlante
Atlas
Atletico
Atria
Attahiru
Attahiru,
Attahiru.
Attai
Attempts
Attendance
Atteveld
Auckland
Auction
Audu
Audu,
Aug
AugSep
August
Austin
Australia
Australian
Austria
Austrian
Authorities
Authority
Auxerre
Avaz
Avg
Aviation
Avraham
Awa
Awa-Ijebu
Awada
Awala,
Awami
Awgu
Awka
Awka,
Awkaoji
Awkunanaw
Awulari
Ayetoro
Ayobo
Ayodele
Ayoola,
Ayr
Ayuba
Azad
Azazi
Azazi,
Azharuddin
Azinta
Azinta,
Aziz
Azubike
Azubuike
Azugaku
Azuka
Azul
Azurunwa,
B
B"
B'
B.
BA
BADAGRY
BADMINTON
BAGHDAD
BALANCE
BALL
BALTIMORE
BAN
BANGKOK
BANGLADESH
BANK
BANKA
BANNED
BANS
BARCELONA
BARRACKS
BARUM
BASE
BASE,
BASEBALL
BASIC
BASKETBALL
BAT
BATALLION,
BATISTUTA
BATKIVSHCHYNA
BATTALION
BAUCHI
BAYELSA
BBI-7.27
BC
BDE
BEACROFT
BEAT
BEECROFT
BEIJING
BEIRUT
BELCHATOW
BELGIAN
BELGRADE
BELL
BENIN
BG
BID
BLIND
BM
BN
BN,
BNP
BNs
BOAT
BOAT,
BOGOTA
BONDS
BONN
BONNY
BOOK
BORNO
BOSS
BOSTON
BOURSE
BOYONA
BRANCH
BRASILIA
BRATISLAVA
BRAVES
BRAZIL
BRAZILIAN
BREGANCON
BRIGADE
BRIGHT-BELGIANS
BRUSSELS
BSG
BT
BUCHAREST
BUDAPEST
BUENOS
BUGNO
BUILDING
BUSINESS
BUT
BVSC
BY
Baba
Babagana
Babatunde
Babb
Babban
Bacau
Bachirawa
Bachirou
Badagry
Bade
Badeh
Badeh,
Badewole,
Badia
Baggio
Baghdad
Bagram
Bagwell
Bahadur
Bahamas
Bahia
Bahrain
Baird
Bakassi
Bakassi.
Baker
Bakori
Bala
Balakov
Balance
Baldato
BalewaTeaching
Balkan
Balkans
Ball
Ballesteros
Balloting
Baltasar
Baltika
Baltimore
Bama
Bama,
Bama-Banki
Bama.
Bamerindus
Bamidele
Bamigboye
Bamigboye,
Ban
Banc
Banco
Bancomext
Banerjee
Banespa
Banfield
Bangkok
Banglabazar
Bangladesh
Bangladeshi
Banharn
Banik
Bank
Banki
Banking
Banska
Bara
Barama,
Barau
Barbara
Barcelona
Bardejov
Bare
Barely
Baresi
Bariga
Barings
Barkho
Barkin
Barnagar
Barnet
Barnsley
Baronti
Barrack
Barracks
Barracks,
Barrick
Barry
Bartha
Bartlomiej
Bartoli
Barton
Base
Base,
Baseball
Basic
Basketball
Basle
Bass
Bassa
Bassey
Bassey,
Bassey;
Basuki
Batagarawa
Batch
Batchelor
Batigol
Batistuta
Batsari
Battalion
Battalion)
Battalion,
Battalions
Battallion
Batting
Battle
Battleford
Bature
Bature.
Bauchi
Bauchi,
Bauchi-Jos
Bauchi.
Bauchi;
Baudone
Bauka,
Baure
Bay
Bayelsa
Bayer
Bayern
Bazza,
Bd
Bde
Beach
Because
Bedi
Bedibunder
Bedouin
Bedouins
Beecroft
Before
Begerow
Begum
Beijing
Beirut
Beja
Bekescsaba
Belarus
Belchatow
Belga
Belgian
Belgium
Belgrade
Belinda
Bell
Bello
Bello,
Belwa
Ben
Bencevic
Benelux
Benes
Benfica
Bengal
Bengali
Benin
Benin,
Benin.
Benishek,
Benjamin
Benue
Berasategui
Berensztain
Berger
Bergkamp
Berkeley
Berkrot
Berkshire
Berlusconi
Bernard
Bernd
Bernini
Berri
Bertelsmann
Berwick
Beryllium
Besides
Between
Bevan
Bgd
Bhattacharya
Bhattarai
Bhavan
Bhavnagar
Biblical
Bichette
Bida
Bids
Bielefeld
Bigade
Bill
Billings
Billy
Bindawa
Bindawa,
Birmingham
Birnin
Birnin-Kudu
Birthday
Bistrita
Bitrus
Biu
Biu,”the
Black
Blackburn
Blackpool
Blacks
Blakey
Blanco
Blank
Blijlevens
Blind
Bloch
Blue
Bn
Board
Boat
Bob
Bobbie
Bobby
Bobic
Bobkova
Boby
Boca
Bochum
Bocobs
Bodo
Boer
Boeta
Boetsch
Bogdan
Bogota
Bogra
Bohdan
Bohemians
Boko
Boko-Haram
Bolaji
Boles
Bolger
Bollore
Bolton
Bomb
Bombay
Bomo
Bomoi,
Bompai
Bona
Bond
Bondholders
Bonds
Bongo
Bonilla
Bonk
Bonn
Bonny
Boogert
Boraine
Bordeaux
Border
Bori
Boris
Borkus
Borno
Borno.
Borokiri
Borrego
Borsuk
Borussia
Bosia-Hercegovina
Bosnia
Bosnian
Bosnians
Boston
Botafogo
Both
Botha
Botham
Botswana
Boudova
Boundary
Bourlet
Bournemouth
Boutros
Boutros-Ghali
Bowling
Boyona
Boyona.
Boys
Braber
Brad
Bradford
Bradtke
Brady
Bradys
Braga
Bragantino
Bragg
Branch,
Brandes
Brandi
Brann
Brasilia
Brasov
Bratislava
Braves
Bravo
Brazil
Brazilian
Bread
Brechin
Breda
Breen
Bremen
Brenda
Brent
Brentford
Bresciani
Brett
Brewers
Brian
Bridge
Bridge.
Briefing
Brig
Brig-
Brig-Gen
Brig-Gen.
Brig-General
Brig.
Brig.-
Brig.-Gen
Brig.-Gen.
Brigade
Brigade,
Brigade.
Brigade;
Brigades,
Brigade’s
Brigade’’,
Brigadier
Brigadier-
Brigadier-General
Brigadier-Generals
Brigadier-Generals,
Bright
Brighton
Brisbane
Bristol
Britain
British
British-based
British-ruled
Briton
Brno
Broadhurst
Bromwich
Broncos
Bronson
Brooke
Brooks
Brother
Brothers
Broward
Brown
Brugge
Bruguera
Brush
Bucharest
Budapest
Budapest-based
Buddhist
Budejovice
Budget
Buenos
Buettner
Bugno
Buhari
Buhner
Buiatti
Building
Buk
Bukuru
Bulabulin
Bulama
Bulatka
Bulgaria
Bulgarian
Bulldogs
Bunce
Bunder
Bundesliga
Buni
Buni-
Bunkure
Bunu
Buratai
Buratai,
Buratai.
Buratai;
Buratia
Bureau
Burhanuddin
Burillo
Burks
Burma
Burmese
Burnley
Burnt
Burra
Burundi
Bury
Busari
Business
But
Buyers
Buzugbe
By
Byron
Bystanders
Bystrica
C
C$
C'
C.
C.I.B.
C.O
CABINET
CAC-40
CAD
CAIRO
CALAB
CALABAR
CALCUTTA
CALIFORNIA
CALL
CAMP
CAMP,
CAN
CANADIAN
CANTONMENT
CAPE
CAPITAL
CAPS
CAPTAIN
CARACAS
CAREER
CART
CATCH
CBF
CBOE
CBOT
CCONSA
CDS
CDS,
CDU
CELL
CENTER
CENTER,
CENTRAL
CENTRE
CENTRE,
CENTRE/NIGERIAN
CEO
CESKA
CESKY
CFDT
CG
CHAMP
CHAMPIONS
CHAMPIONSHIP
CHANG
CHDS
CHICAGO
CHIEF
CHILD
CHILE
CHILLICOTHE
CHINDIT
CIB
CID
CINCINNATI
CIS
CITY
CIVIL
CIVIL-MILITARY
CIVIL-Military
CIVILIANS
CJTF
CKD
CLEARED
CLEVELAND
CLINCH
CLUB
CMD
CNC
COAS
COAS)
COAS,
COFINEC
COLL,
COLLATED
COLLECTIVE
COLLEGE
COLLEGE,
COLOG,
COLOMBO
COLONNA
COLORADO
COMD
COMEX
COMMAND
COMMAND,
COMMISSION
COMMISSIONS
COMMITTEE
COMPANY,
COMPETITIVE
CONDITION
CONFIRMED
CONGO
CONSECUTIVE
CONTENTS
CONTRIBUTED
COOPERATION
COPP.
CORPS
CORPS,
CORRECTED
CORRIDOR
COSTA
COUNCIL
COUNTY
COWSLIP
CP
CP.
CPN
CPS
CRICKET
CRIMES
CSKA
CSP
CSU
CTBT
CUBA
CUBS
CULTURE,
CUP
CURRENCIES
CUSIP
CVG
CYBER
CYCLING
CYPRIEN
CYPRUS
CZECH
CZK
Cabinet
Caboche
Cacic
Caddick
Cadre
Caesar
Caesarea
Cairns
Cairo
Cal
Calabar
Calabar,
Calabar.
Caland
Calcutta
Caldwell
California
Callens
Cambridge
Camdzic
Cameroon
Cameroon,
Cameroonian
Caminiti
Camp
Camp,
Campana
Campbell
Campora
Canada
Canadian
Canberra
Cancelled
Candiotti
Canopic
Cantonment
Cantonment,
Capacity
Capiot
Capital
Capriati
Capt.
Captain
Captains.
Caracas
Carbonell
Cardiff
Cardinals
Cardoso
Carey
Carl
Carl-Uwe
Carlisle
Carlos
Carlsen
Carlsson
Carlton
Carneiro
Carnival
Carol
Carrefour
Carretero
Carril
Carter
Casablanca
Casagrande
Cascarino
Casey
Cash
Cast
Castilla
Castleford
Castro
Cast”,
Catholic
Catholics
Caucasus
Cause
CeBIT
Cea
Ceahlaul
Cecchini
Cecil
Cedric
Celaya
Celica
Cell
Celsius
Celtic
Centeno
Center
Center,
Central
Centre
Centre,
Centre;
Cercle
Cervera
Cesar
Ceske
Chad
Chad.
Chairman
Challenge
Challenges
Chaloner
Chamber
Chamorro
Championship
Chancellor
Chandigarh
Chandra
Chandraratne
Chandrika
Chang
Channel
Chapman
Charanchi
Charge
Charity
Charleroi
Charles
Charleston
Charlton
Chart
Chavakachcheri
Cheah
Cheary
Chechen
Chechens
Chechnya
Chelny
Chelsea
Chemlon
Chen
Chernomorets
Chernomyrdin
Chester
Chesterfield
Cheuvreux
Chevron
Chg
Chi
Chiapas
Chibok
Chicago
Chief
Children
Chile
China
China-bound
Chindia
Chinese
Chioba
Chiquinho
Chirac
Chonan
Chonbuk
Chong
Chonnam
Chornomorets
Chorzow
Choudhury
Chris
Christian
Christina
Christmas
Christopher
Chronic
Chuck
Chuka
Chuku
Chukwu
Chukwu,
Chukwuemeka,
Chukwunedum
Church
Churokusko
Ciller
Cincinnati
Cinema
Citing
Citko
City
City,
Civil
Civil-Military
Civilian
Civilian-JTF
Claire
Clarence
Clarksburg
Classic
Claude
Claudio
Clavet
Claydon
Clayton
Clean
Cleen
Clement
Clercq
Cleveland
Clinical
Clinton
Cloete
Clontz
Club
Cluj
Clyde
Clydebank
Co
Co-ordinator,
Coal
Coast
Coconut
Cocu
Coers
Coetzee
Coetzer
Cofinec
Col
Col.
Colchester
Colin
Collated
Collective
Collectivisation
College
College,
Collin
Collingwood
Collstrop
Cologne
Colombia
Colombian
Colombo
Colon
Colonel
Colonels.
Colonna
Colorado
Coltart
Columbus
Combat
Commad
Command
Command)
Command,
Commandant
Commandant,
Commandant-General
Commandant.
Commanded
Commander
Commander,
Commander.
Commander/Nigerian
Commander;
Commanders
Commanders,
Commanding
Commanding,
Commanding;
Commandments
Commands
Commended
Commenting
Commercial
Commission
Commission,
Commissioner
Commissioners
Commission’s
Commitment
Committee
Commodities
Commodore
Commodores
Commonwealth
Communication,
Communications
Communist
Communities
Community
Companies
Company
Company,
Company.
Competition
Complex
Composite
Comprehensive
Conc
Concern
Conchita
Conde
Conditions
Condominium
Confederation
Conference
Confirmed
Conglomerate
Congo
Congress
Congress,
Congressman
Consequently
Consequently,
Constand
Constanta
Construction
Consumer
Contacted
Contingent
Contracts
Contributing
Control
Convention
Conversion
Coolee
Cooperation
Cooperative
Coordination
Coordinator,
Copland
Copper
Cordova
Corina
Corini
Corinthians
Coritiba
Cork
Cororation
Corp
Corp.
Corporacion
Corporate
Corporation
Corps
Corps,
Corrects
Correspondent
Corretja
Costa
Costain
Costantino
Cottey
Council
Counter
County
Coupon
Courier
Course
Court
Courtney
Courtois
Covas
Coventry
Cowdenbeath
Cozma
Craig
Craiova
Crawley
Craybas
Creedmoor
Crewe
Criciuma
Cricket
Cricuma
Crime
Crimes
Criminal
Cristina
Critics
Croat
Croatia
Croatian
Crocodile
Croft
Cronulla
Cross
Crossing.
Crowds
Crown
Cruyff
Cruz
Cruzeiro
Crvena
Crystal
Csepel
Cuba
Cubs
Culpepper
Cultural
Culture,
Cunningham
Cup
Curitiba
Current
Currin
Curtis
Customs
Cut-off-rate
Cynthia
Cyprien
Cyprus
Cyprus-based
Czech
Czestochowa
D
D'
D-G
D.
D.C.
D.J.
DAC
DAILY
DAKOTA
DALLAS
DAMISA,
DAPP
DAPR
DASE
DATE
DATOPS
DATOPS,
DAX
DAY
DAYS
DBRS
DC
DCMA
DCP
DD
DDF
DDI.
DE
DECLARE
DECREE
DEFENCE
DEFENSE
DEFENSE,
DELHI
DELIVERY
DELTA
DELTA,
DEM
DEMO
DEPARTMENT
DEPARTMENT,
DEPORT
DEPOT
DEPOT,
DEPT
DEPT.
DET
DETACHMENT,
DETROIT
DHAKA
DHQ
DHQ,
DHQ;
DIA
DICON,
DIEGO
DIG
DIGEST
DINAMINA
DIRECT
DIRECTORATE
DISPOSAL
DIVAINA
DIVIDED
DIVISION
DIVISION,
DIvision
DKBA
DLJ
DLS.
DM
DMI,
DO
DOAL
DOCKYARD,
DOCUMENT
DODGE
DOLE
DOLE,
DOLE.
DOO
DOPING
DOPs
DOPs,
DOUBLE
DPO
DPO,”Abubakar
DPU
DRAFTING,
DRAW
DSP
DSS
DTB-Bund-Future
DTD
DUBAI
DUBLIN
DUE
DUSTOUR
DUTCH
Dacia
Dafur
Dafur,
Dagala
Dahl
Dahshour
Daily
Daish
Daji
Daji'
Dakatsalle
Dakota
Dala
Dalian
Dallas
Dally
Dam.
Damagum
Damasak,
Dambatta
Dambazau
Damboa
Damboa,
Damboa-Biu
Damboa.
Damein
Damm
Dan
Dana
Dance
Dance,
Dance.
Dandume
Dangnap
Daniel
Danja
Danjuma,
Danmusa
Danny
Dante
Danut
Darfur
Darfur,
Darfur.
Dariusz
Dark
Darlington
Darren
Das
Daschle
Dasuki.
Data
Date
Dauke
Dauke,
Daura
Daura,
Dave
Davenport
David
Davids
Davidson
Davies
Davis
Dawakin
Day
Dayana
Dayton
De
DeJesus
Dead
Dealers
Dean
Dearest
Debbie
Debi,
Debrecen
Dec.
December
Dechaume-Balleret
Decheiver
Dechy
Decker
Deere
Def.
Defence
Defence,
Defence.
DefenceHeadquarters
Defenders
Defending
Defense
Defense,
Defense.
Defense/Army
Defense/Ministry
Defense/Special
DefenseMinistry
Dehaan
Dejan
Dekker
Del
Delgado
Delhi
Delivery
Delmas
Delta
Delta,
Delta.
Delwa
Demand
Dembinski
Demirel
Demo
Democracy
Democrat
Democratic
Democrats
Demsa
Denham
Denis
Denmark
Dennis
Department
Depending
Deployment
Deport
Deportivo
Depositary
Depot
Depot,
Dept
Dept,
Deputy
Derby
Derbyshire
Derivatives
Des
Desailly
Described
Describing
Desk
Desk,
Desmond
Despite
Detroit
Detroux
Dev
Development
Development,
Devereaux
Device
Devices
Deville
Dewas
Dewulf
Dhahran
Dhaka
Dhar
Diamond
Diario
Dibi
Dibi,
Dibi.
Dickson
Did
Diego
Diego-based
Dier
Dike
Dike,
Dikko
Dikwa
Dinamo
Diplomatic
Diplomats
Director
Director,
Directorate
Directorate,
Dirk
Disarmament
Disarming
Disclosing
Displaced
Disposal
Distributors
District
District,
Div
Div,
Div.
Div.,
Divion
Division
Division,
Division.
Divisional
Divisionn
Divisions
Division’s
Divsion
Diya
Djiwandono
Dmitry
Dnevi
Dnipro
Dnipropetrovsk
Do
Dobeli
Doboj
Dockyard
Dockyard,
Doctor
Doctors
Doctrine
Dodgers
Doe
Doetinchem
Dogon
Doguwa
Doksa
Dole
Dole,
Dole.
Dole”,
Domestic
Domingo
Domingos
Dominic
Dominion
Dominique
Don
Doncaster
Donetsk
Donkow
Donne
Dopemu
Dopfer
Dopita
Dortmund
Dos
Dostum
Doubeli
Doug
Dow
Down
Dr
Dr.
Dragomir
Dragutin
Draper
Drawn
Drechsler
Drew
Drnovice
Drnovsek
Drug
Dublin
Dubnica
Due
Duesseldorf
Duisberg
Duisburg
Dukku
Dukla
Duluth
Dumbarton
Dumne
Dunajska
Dundee
Dunfermline
Dunukofia
Dure
Durham
During
Durres
Durum
Dustin-ma
Dustinama
Dustinma
Dutch
Dutchman
Dutroux
Dutse
Dutsi
Dynamo
Dynasty
E
E'
E-mail
E.
E.B
E.F.
EA
EARLY
EASE
EASTERN
ECOMOG
ECOMOG,
ECOWAS
ECR,312BN,353BN
EDBERG
EDGE
EDO
EDT
EE
EFCC
EG
EKPE,
ELECTION
ELITE
ELIZABETH
EMBASSY
EMD
EMKAM
EMU
ENC
END
ENDS
ENGINEER
ENGINEERING
ENGINEERS
ENGLAND
ENGLISH
ENHANCEMENTS
ENTRY
ENUGU
EO
EPIC
EPR
EPS
EQUITY
ERP
ESCRAVOS,
ESD
ESSEX
ESSIEN
ETHIOPIA
EU
EUROPEAN
EVALUATION
EXCHANGE
EXER
EXERCISE
EXTENDS
Eales
Ealham
Earlier
Earlier,
Earth
East
East,
East.
East:DPO
Eastern
Eau
Ebe
Ebenezer
Ebere
Ebiobowei
Ebo
Ebobowei
Ebonyi
Eco
Ecological
Economic
Economist
Economy
Ecuador
Ed
Edberg
Eddie
Eddo
Edet
Edet,
Edgar
Edhem
Edi,
Edim
Edna
Edo
Edo,
Eduardo
Education
Edwards
Edwin
Eefje
Eelam
Efendija
Effiong
Efforts
Egypt
Egyptian
Egyptians
Eight
Eighth
Eighty
Eindhoven
Ejup
Ekanem,
Ekechukwu
Ekeren
Eket
Ekeus
Ekiti
Ekiti,
Ekpene
Ekpo
Ekwe,
Ekwenugo
El
Eldred
Elect
Election
Elections
Electoral
Electronic
Elele
Eleme
Elemoro
Elena
Elere
Eletropaulo
Eleven
Elf
Eli
Elijah,
Elimgbu
Elland
Ellis
Ellwood
Els
Elsewhere
Elsner
Elves
Emajuddin
Embassy
Emeka
Emele
Emene
Emeraud
Emergency
Emerson
Emese
Emilio
Emir
Emmanuel
Emnid
Endrio
Endt
Energy
EnergyNational
Enforcement
Engagement
Engagement)
Engineer
Engineer,
Engineering
Engineering,
Engineers
Engineers,
Engineers”
England
English
Enn
Enobong
Enqvist
Enraged
Enrique
Enschede
Enugu
Enugu,
Enugu.
Environment
Envoy
Envrionmental
Epe
Epelle,
Equipment
Erbakan
Erdei
Erekat
Ericks
Eriksson
Ernest
Eromosele,
Erwin
Erzincan
Escort
Esnaider
Espanol
Essendon
Essex
Essilor
Estate
Estimated
Estonia
Estonian
Estudiantes
Etan,
Ete-Ibas,
Ethan
Ethan,
Ethan.
Ethiopia
Etim
Etinan
Etiti
Eugene
Eurobourses
Eurograde
Europe
European
Eurotunnel
Eva
Evaluation
Evaluation,
Evaluations
Evans
Eve
Even
Everton
Every
Everyone
Ewanshia,
Ewansia,
Ewansiha,
Ewe
Ewekoro
Ewet
Excellency,
Exchange
Excise
Excluding
Executive
Exercise
Exeter
Expectations
Expected
Experts
Explosive
Explosives
Export
Exports
Expos
Expressing
Extras
ExxonMobil
Eyewitnesses
Ezeagu
Ezeoba
Ezeoba,
Ezer
Eziama
Ezike
Ezinifite
Ezinwa
Ezugwu
Ezugwu.
F
F-14
F-7
F.A.
F.C.
F.H.
F.M
F.O.
F.O.Alli
F.W.
FAB
FACILITIES
FAIL
FAIR
FALL
FAN,
FARC
FARM
FBI
FC
FCID
FCT
FDP
FEATURE
FEDERAL
FERRIGATO
FESTACH
FFT
FHQS
FIFA
FILING
FINAL
FINALS
FINANCE
FINANCIAL
FINLAND
FIORENTINA
FIREBUSH
FIRST
FIS
FITCH
FIXTURES
FK
FLEET
FLEET,
FLORIDA
FLUSH
FLYING
FN
FO
FOB
FOCUS
FOR
FORCE
FORCE,
FORCES
FORECAST
FOREIGN
FORT
FOURTH
FRANCE
FRANCISCO
FRENCH
FRIENDLY
FROM
FRONT
FSARS
FSU
FTC
FTS
FTSE
FUTURE
Faber
Fabio
Facchinetti
Fagan
Fagge
Fahnestock
Fahrenheit
Fair
Fairbrother
Fairmont
Faizy
Falgore
Falkir
Fall
Fambiya,
Famous
Famuyiwa,
Fans
Far
Farina
Farm
Farouk
Farrelly
Farul
Faskari
Fatai
Father
Fatima
Fatori,
Faulding
Fax
Fears
Feb
February
February,
Federal
Federation
Federico
Fedoruk
Fegge
Fegge,
Fehervar
Fejoku,
Felipe
Felix
Felo,
Fenandez
Ferencvaros
Fernandes
Fernandez
Fernando
Ferreira
Ferrigato
Ferris
Ferro
Fertile
Fes
Festac
Festus
Feyenoord
Ffr
Fidelia
Field
Fife
Fifteen
Figures
Fika
Filip
Filippini
Filippo
Final
Finally
Finance
Financial
Fine
Finland
Finley
Finn
Finnish
Fiona
Fiorentina
Fire
Firgi
First
Fiscal
Fitzpatrick
Fitzroy
Five
Fla.
Flach
Flag
Flamengo
Flavin
Fleet
Fleet,
Fleming
Flemming
Fletcher
Fleuchaus
Flight
Floor
Flora
Florence
Florencia
Florida
Flour
Flower
Fluminense
Flush
Flushing
Flying
Fokker
Following
Fondriest
Fontaine
Fook
Football
Footscray
For
Force
Force)
Force,
Forces
Ford
Foreign
Foreldorado
Forest
Forest,
Forest.
Forfar
Formations
Former
Formula
Forsa
Forschungsgruppe
Fortuna
Forum
Forward
Foster
Foundation
Four
Fourth
Frana
France
France-Juppe
Francesca
Francesco
Francisco
Franco
Frank
Frankfurt
Frankie
Frazier
Fred
Frederic
Frederick
Free
Freedom
Freeh
Freeport
Freezing
Freiburg
Fremantle
French
French-registered
Frenz
Friday
Friday,
Friday.
Friday’s
Friends
From
Front
Frowick
Fuel
Fulani
Fulcheri
Fulham
Fulton
Funar
Funtua
Furlan
Further
Furthermore
Fusai
G
G.
G.O.C.,
G.T.A.
GAIDE,
GAK
GAME
GAMES
GAN
GAR
GARKI
GARKI,
GARKI-ABUJA
GARKI-ABUJA,
GB
GDP
GDS
GEARING
GENDER
GENERAL
GENEVA
GERMAN
GH-12
GIANTS
GIVES
GKS
GLAD
GLASGOW
GMT
GOALLESS
GOALSCORERS
GOC
GOC,
GOC,Major
GOCs
GOCs,
GOLF
GOMBE
GOOCH
GOV
GOVERNMENT
GRAND
GRIQUALAND
GRONINGEN
GROUNG
GROUP
GROUP,
GROWTH
GUARDS
GUNSHIP
Gabi
Gabon
Gabor
Gabriel
Gabriele
Gagariga
Gagiano
Gagne
Gaidam
Gaidano
Gajdos
Gala
Galadima
Galarraga
Galati
Gallen
Galo
Gama
Gamawa
Games
Gana
Gani
Ganic
Ganjuwa
Gano
Ganye
Garang
Garba
Garba,
Garcia
Gareth
Garhi
Gari
Garin
Garison
Garki
Garki,
Garrision
Garrison
Garrison,
Garrison.
Garrity
Garry
Gary
Gashigar,
Gashua
Gasoline
Gastel
Gaston
Gatwick
Gavaldon
Gaya
Gaza
Gboko
Geelong
Geert
Geire
Gen
Gen.
Gencor
General
General,
General.
Geneva
Genk
Genral
Gentext
George
Georges
Georgia
Georgy
Gephardt
Gerald
Gerard
German
German-based
Germany
Gezawa
Ghent
Gheorghe
Giaconi
Giade
Gianluca
Gianni
Giants
Gibbs
Gida
Gideon
Gidigori
Gift
Gigi
Gil
Gilbert
Gilbertson
Giles
Gillingham
Gimnasia-Jujuy
Gimnasia-La
Ginebra
Gingrich
Giovanni
Giro
Given
Glafcos
Glamorgan
Glass
Gleeson
Glen
Glenallen
Glenn
Glimt
Global
Globo
Gloria
Gloucestershire
Glyn
GmbH
Goalkeepers
God
Godee
Godwin
Goey
Gogele
Goias
Golau,
Gold
Goldman
Goldsmith
Gombe
Gombi
Goniri
Gontchenkov
Gonzalez
Gooch
Goodluck
Goosen
Goossens
Gopal
Gordana
Gordon
Gore
Gornik
Goron
Gorre
Gorrochategui
Gouda
Gough
Goulding
Gov
Gov.
Government
Government’s
Governor
Governor,
Governors
Governor’s
Govett
Govt
Gowon
Graafschap
Grabb
Grabowksi
Grabowski
Grace
Grade
Graeme
Graf
Graham
Grand
Grande
Grandstand
Grant
Gras
Grasshopper
Graz
Greater
Greenock
Greens
Greg
Gremio
Greneral
Gress
Grimsby
Grimwade
Griqualand
Gronholm
Groningen
Gross
Grossman
Ground
Group
Group,
Grozny
Grzybowska
Guadalajara
Gualtiero
Guarani
Guarantee
Guard
Guards
Guards'
Guards,
Guayana
Gubio
Guernsey
Guerrero
Guillaume
Guillermo
Guimaraes
Gul
Gulak
Gulbuddin
Guldimann
Gulf
Gumy
Gun
Gurads
Gurion
Gustafsson
Guus
Guy
Guzman
Gwagwalada
Gwagwarwa
Gwale
Gwaoi
Gwarzo
Gwoza
Gyor
H
H.
H/QTRS
H1
H2
HAARETZ
HAARLEM
HANOVER
HARCOURT
HARCOURT,
HAVEN
HE
HEADBUTT
HEADQUARTER
HEADQUARTERS
HEADQUARTERS,
HEADQUATERS
HEADQUATERS)
HEAVY
HELENS
HELIBOR
HELICOPTER,
HELSINKI
HISTORIC
HITS
HMG
HO
HOCKEY
HOLD
HOLDING
HONDURAS
HONG
HOSPITAL
HOUSE
HOUSE,
HOUSTON
HQ
HQ,
HQ1
HQS
HQg
HRW
HUBER
HUNGARY
Haarlem
Haas
Habib
Habibullah
Habsudova
Hack
Hadejia
Hadlee
Hagner
Haitai
Haiti
Haladas
Haldtime
Halford
Halftime
Halifax
Hall
Ham
Hamas
Hamburg
Hamid
Hamilton
Hamman
Hamman,
Hamming
Hampshire
Handgun
Handing
Hanifah
Hanover
Hansa
Hansma
Hanson
Hanwha
Happily
Happy
Haram
Haram,
Haram.
Haram;
Harb
Harcourt
Harcourt,
Harcourt.
Harcourt;
Harding
Harelbeke
Hariri
Harmony,
Harrington
Harris
Hart
Harte
Hartlepool
Haruna
Harvest
Hasan
Hashem
Hashimoto
Hasina
Hassan
Hassania
Hausa
Hauwa
Havel
Haven
Haven)
Havre
Hawthorn
He
Head
Headingley
Headley
Headqaurters
Headquarter
Headquarter,
Headquarters
Headquarters,
Headquarters,DHQ,
Headquarters.
Headquarters."
Headquarters;
Health
Healy
Hearts
Heath
Heathrow
Heaven)
Heavy
Hector
Heerenveen
Hegi
Heike
Heiki
Heinrich
Heinz-Peter
Hekmatyar
Helder
Helena
Helens
Helibor
Helmut
Helsinki
Henderson
Hendrika
Henman
Henrietta
Henrique
Henry
Her
Here
Hereford
Herman
Hezb-i-Islami
Hibernian
Hick
Hiddink
High
High-priced
Hijacked
Hilary
Hill
Hillary
Hincapie
Hinckley
Hingis
Hiraki
His
Hlasek
Hoare
Hock
Hockey
Hoechst
Hoffman
Hogg
Hoko
Holding
Holdings
Hollandsworth
Hollioake
Home
Homewood
Homme
Hon
Hon.
Honduras
Hong
Hoogma
Hooper
Hope
Hopefully
Hoping
Hopkins
Hosea
Hospital
Hotels
Hotoro
Houghton
House
House,
Houses.
Housing
Houston
How
Howard
Howe
However
However,
Hqtrs
Hradec
Hriday
Hryhory
Hubbard
Huber
Huddersfield
Hueite
Huizinga
Hull
Hulse
Human
Humayun
Humberto
Humenne
Humphries
Hundreds
Hungarian
Hungary
Hunte
Hunter
Huntington
Huracan
Huracan-Corrientes
Hurte
Husarova
Hussain
Hussein
Hutnik
Hyacinth
Hybrid
Hyundai
I
I.
I.I.
IA
IBIS
IBOM
ICE
ICPC
ID
IDP
IE
IF
IGBOKODA
IH
IHC
II
III
III.ker.TVE
II’,
IJEDE
IKEJA
IKEJA,
IKORODU
IKOT
IKS
ILASHE
ILORIN
ILUPEJU
IM
IMED
IMO
IMOTA
IMPLEMENTATION
IN
IN-NAZZJON
INDIA
INDORE
INFANTRY
ING
INNINGS
INSPECTOR
INTEL
INTELLIGENCE
INTELLIGENCE,
INTELLIGENT
INTEREST
INTERNAL
INTERNATIONAL
INTERNATIONALS
INTERPOL
INTL
IOC
IPAKODO
IPE
IPO
IPOB
ISLAMABAD
ISLAND
ISLAND,
ISS
ISSUE
ISSUER
IT
ITALIAN
IV
IVAC
Iacomella
Ian
Ibadan
Ibadan,
Ibadan.
Ibadan;
Ibafo
Ibara
Ibas,
Ibeno
Ibese
Ibesikpo
Ibesikpo-Asutan
Ibiono
Ibogun
Ibok
Iboko
Ibom
Ibom;
Ibraheem
Ibrahim
Ibrahim,
Ibrahim.
Ibrahimi
Ichi
Idalecio
Idi-Ape
Idimu
Idiroko
Idoko
Idoko,
Idonsi
Idowu
Idris
If
Ifako
Ifeanyi
Ifo
Igando
Igbeba
Igbo
Igbo-Etiti
Igbo-Eze
Igboeze
Igbologun
Igwe
Ihala
Ihejirika
Ihejirika,
Ihiala
Ijaiye
Ijanikin
Ijaz
Ijebu-Igbo
Ijebu-Ode
Ijede
Ijora
Iju
Ika
Ikeja
Ikenne
Ikioda,
Iko
Ikom
Ikorodu
Ikot
Ikotun
Ikwerre
Ilaro
Ilasan
Ilashe
Ileana
Ilemba
Ilese
Iliescu
Illawarra
Illinois
Illness
Ilo
Ilorin
Ilorin,
Ilouga;
Ilupeju
Ilyasu
Imala
Imeko
Immaculate
Immediate
Immigration
Imo
Imota
Impala
Implats
Implementation,
Impreza
Improvised
Imran
In
Inalegwu
Inc
Inc.
Income
Incumbent
Indeed
Independence
Independent
Independiente
Index
India
Indian
Indian-ruled
Indiana
Indians
Indies
Indonesia
Indonesian
Indore
Indra
Inducting
Industries
Industry
Ines
Inez
Inf
Infantry
Infantry,
Information
Information,
Ingwe
Ini
Inland
Innsbruck
Inquiry
Inspector
Instead
Institute
Institutions
Insurance
Insurers
Insurgency
Integrated
Intelligence
Intelligence,
Inter
Inter-Brigade
Inter-Entity
Interacciones
Interbank
Interest
Interfax
Interior
Internacional
Internal
Internally
International
Internazionale
Internet
Interpol
Inverness
Investigation
Investigations
Investigators
Investment
Investors
Inzamam-ul-Haq
Ion
Iowa
Ipaja
Ipakodo
Iperu
Ipokia
Iponri
Ipsos
Ipswich
Irabor
Irabor,
Irabor.
Irani
Iraq
Iraq-U.N.
Iraqi
Iraqis
Irede/Ikanre
Ireland
Irene
Irina
Irish
Irwin
Is
Isa
Isa,
Isaac
Isah,
Isaiah
Isang
Isara
Iseyin
Ishaku
Ishara
Ishasi
Isheri
Ishiaku
Isiala
Isibor
Isidore
Isikwuato
Isimiri
Isimmiri
Isiokpo
Islam
Islamic
Islamist
Islamists
Island
Islands
Isokoko
Israel
Israel-PLO
Israeli
Issuer
Isuikwuato
It
Itabor
Italian
Italy
Itam
Itar-Tass
Itele
Its
Itu
Iva
Ivan
Ivano-Frankivsk
Iwuoha,
Iyaganku
Iyana
J.
J.A.H
J.A.H.
J.J.
J.S
JA
JAJI
JAJI,
JAKARTA
JANEIRO
JAS
JC
JERUSALEM
JET
JMSTC
JOHANNESBURG
JOINS
JOINT
JONK
JORDAN
JOS
JOSE
JOURNAL
JS
JTF
JTF's
JTF,
JTF’s
JTORO
JUBILEE
JULY
JUNE
JUSTICE
JUVENILE
JYVASKLYA
JYVASKYLA
Jaap
Jabali
Jablonec
Jacek
Jack
Jackie
Jackiewicz
Jackson
Jacob
Jacques
Jadida
Jafa’aru
Jaffna
Jaha
Jaime
Jaji
Jaji,
Jaji.
Jaji;
Jakarta
Jalabert
Jalalabad
Jalil
Jalingo
Jamaica
James
Jamroz
Jan
Jana
Janakantha
Jane
Janeiro
Janette
Janez
Janis
Janne
Jannie
Jans
Jansher
January
January-June
Jaora
Japan
Japanese
Jarawa
Jardel
Jared
Jarmo
Jason
Jatau
Javier
Jay
Jays
Jean
Jean-Paul
Jean-Pierre
Jecmenica
Jeddah
Jeff
Jeffrey
Jemitola
Jennifer
Jensen
Jeroen
Jersey
Jerusalem
Jesse
Jessen-Petersen
Jesus
Jetsi
Jetty
Jeunesse
Jewish
Jiang
Jiangsu
Jiaxuan
Jibrin
Jibrin,
Jigawa
Jill
Jim
Jimeta
Jimmy
Jimoh
Jimoh,
Jimy
Jing-Qian
Jiri
Jiul
Joannette
Joao
Jodie
Jody
Joe
Joey
Johan
Johannesburg
Johansson
John
Johns
Johnson
Johnstone
Joining
Joint
Jolene
Jon
Jonathan
Jonathan,
Jonathan.
Jones
Jonk
Jonzon
Jordan
Jordanian
Jordanians
Jordi
Jornada
Jos
Jos).
Jos,
Jos.
Jos;
Jose
Josef
Joseph
Joseph;
Jos—General
Journal
Jr
Juan
Jubrin,
Judicial
Judith
Juha
JulAug
Julie
Julio
Julius
July
July-August
Jumbish
Jumbish-i-Milli
Junction
June
Junior
Juniors
Juppe
Just
Justice
Justin
Juventude
Jyrki
K
K-SHEETS
K.
K.C
K.N
K/Fada
KABLO
KABUL
KADUNA
KAINJI,
KANO
KANSAS
KARACHI
KARU
KATHMANDU
KB
KC
KDP
KEEPING
KENNY
KICK
KIEV
KIMBERLEY
KIRKCALDY
KIRKLAND
KLADNO
KNU
KOMERCNI
KONG
KOREAN
KSE
KSE-100
KTJ
KUALA
KYANWA
Kabariti
Kabir
Kabiru
Kabul
Kabul-Salang
Kacem
Kachia,
Kadian
Kaduna
Kaduna,
Kaduna-Abuja
Kaduna.
Kaduna;
Kafa
Kafanchan
Kafelnikov
Kafiya
Kahalani
Kaliningrad
Kamaldeen
Kamaz
Kamio
Kamoga
Kamyshin
Kan
Kandahar
Kandarr
Kangarawa
Kangarwa,
Kankkunen
Kano
Kano-Nigeria
Kano;
Kansas
Kantagora,
Kanu,
Kapil
Karachi
Karak
Karame
Karbacher
Karen
Karim
Karin
Karina
Karlsruhe
Karlsson
Karma
Karpaty
Karvina
Kashim
Kashmir
Kasimu
Katagum
Katagun
Katarina
Kate
Kathy
Katowice
Katsina
Kaucuk
Kawuri
Kawuri,
Kayode
Kazakhstan
Kebbi
Keeping
Keffi.
Keith
Kelly
Kemp
Kemta
Ken
Kenna
Kennedy
Kenneth
Kenny
Kent
Kentucky
Kenya
Kenyan
Kerametal
Kerkrade
Kernaghan
Ketu
Kevin
Key
Khadga
Khaleda
Khan
Khandwa
Khartoum
Khobe
Khouribga
Khum
Ki-choo
Kibet
Kibitok
Kibiya
Kidnappers
Kidnapping
Kiev
Kijimuta
Kilda
Kilmarnock
Kim
Kimberly
Kimiko
King
Kingdom
Kingdom,
Kingsley
Kingston,
Kinsley
Kirikiri
Kirovohrad
Kirzan
Kispest
Kit
Kitchener
Kiyawa
Kleinova
Klerk
Klimis
Klinsmann
Kneipp
Knight
Knoroz
Knowles
Knowsley
Kobe
Kock
Koepke
Koerts
Kofar
Kofi
Kofo
Kogi
Kohl
Koko,
Koleosho
Koleosho,
Koleoso
Koleoso,
Kolumbina
Komala
Komarica
Konduga
Kong
Kongsvinger
Kontagora;
Korda
Korea
Korean
Korean-related
Korneev
Kors
Kosice
Kostantin
Kostas
Kotokuma
Kotokuma,
Kournikova
Kpor
Kragujevac
Krajicek
Krakow
Kralove
Kranich
Kreissig
Kremenchuk
Kremin
Kremlin
Kris
Kristie
Kristina
Krpaco
Kruger
Krylya
Kryvbas
Kryvy
Krzysztof
Kschwendt
Kucan
Kudu
Kuhn
Kuje
Kujeri
Kukasheka
Kukawa
Kukic
Kulti
Kumapayi
Kumaratunga
Kumshe.
Kunar
Kuperman
Kurd
Kurdish
Kurdistan
Kurds
Kurt
Kusada
Kuwait
Kuznets
Kwabe
Kwaji
Kwali
Kwalli
Kwara
Kwaskebe
Kwaskebe,
Kwasniewski
Kyanwa
Kyanwa,
Kyle
Kyoko
Kytolehto
L
L-ORIZZONT
L.C.
L.O.
L.W.
LA
LAFIYA
LAGOS
LAGOS-NIGERIA
LAKES
LANA
LAND
LANKADEEPA
LARGELY
LARNACA
LAST
LATEST
LAUDERDALE
LC
LE
LEADING
LEAGUE
LEAVE
LECIVA
LEEDS
LEGAL
LEWIS
LG
LIBERIA
LINZ
LION
LISBON
LIST
LISTING
LJUBLJANA
LKJ
LKS
LMC
LME
LOG
LOGISTIC
LOGISTICS
LOGISTICS,
LOGISTICS/NIGERIAN
LOME
LON
LONDON
LOS
LOSE
LOT
LOUIS
LP
LTTE
LUMPUR
La
Labat
Labor
Labour
Laca
Lada
Ladi
Lafenwa
Lafia
Lafia.
Lafiya
Lafiya)
Lagos
Lagos,
Lagos.
Lagos;
Laka,
Lakanu
Lake
Lakes
Lala
Laleye
Laleye,
Lambrecks
Lamidi
Lamisula
Lamonts
Lampi
Lancashire
Lance
Lancer
Land
Lane
Langbasa
Langrova
Langtang
Lanka
Lankan
Lanus
Lanusse
Lapentti
Lar(2nd
Laranto
Larisa
Larnaca
Larry
Lasisi
Lasse
Last
Late
Later
Latest
Latif
Latin
Latvia
Lauren
Laurence
Laurent
Lausanne
Law
Lawrence
Lawrie
Lawton
Laxmi
Layeni
Layout
Le
Lead
Leaders
Leadership
Leading
League
Leander
Lebanese
Lebanon
Lebed
Lech
Lee
Leeds
Leftist
Legal
Legia
Leicester
Leicestershire
Lejeune
Lelouche
Lennart
Lens
Leo
Leon
Leonard
Leone
Leoni
Lerner
Letitia
Leverkusen
Levingston
Levitt
Levy
Lewis
Leyton
Liaison,
Liam
Liaoning
Liberation
Liberec
Liberia
Liberia,
Liberia.
Liechtenstein
Liege
Lierse
Lieutenant
Lieutenant-General
Lieutenants
Lift
Light
Likhovtseva
Liliana
Lillee
Lillestrom
Lilly
Lima
Limited
Limited,
Limited.
Lincoln
Linda
Lindholm
Lindsay
Lindsey
Line
Linhart
Linz
Linzer
Lira
Lisa
Lisbet
List
Liu
Liutauras
Liverpool
Livingston
Liwaya
Llong
Lloyd
Local
Lodge
Lodz
Loewen
Loftus
Logisitics
Logistic
Logistics
Logistics,
Logistics.
Logistics;
Lokeren
Lokomotiv
Lokomotiva
Lomas
Lome
Lommel
London
London-based
London.
Londono
Lonrho
Looi
Looking
Lord
Lorenzo
Lori
Los
Lotte
Louis
Love
Lovell
Lows
Lt
Lt-
Lt-Gen.
Lt.
Lt.-
Lt.-Col.
Lt.-Gen.
Ltd
Lu
Lubiani
Lubin
Luc
Lucerne
Lucky
Ludmila
Lugano
Lugo
Luis
Luka
Lumme
Lungi
Lupu
Luton
Luxembourg
Lviv
Lynch
L’UNAMID/Darfour
M
M.
M.D
M.S.A.
M.T.
M1
M2
M3
MA
MAARIV
MAE
MAIDIGURI
MAIDUGURI
MAINTENANCE
MAJOR
MAKINDE
MAKINEN
MAKURDI
MALAYSIAN
MALEEVA
MAN
MANAGER
MANAGUA
MANAMA
MANCHESTER
MANILA
MAPUTO
MARACAIBO
MARITIME
MARKETS
MARSEILLE
MATCH
MATUZICI
MAXWELL
MAY
MB
MBIA
MC
MD
MEDICAL
MEDIUM
MEETING
MELBOURNE
METALS
METROSTAV
MEXICAN
MEXICO
MF
MFA
MFS
MG
MGR
MIAMI
MIINISTRY
MILAN
MILITARY
MILWAUKEE
MIN
MINISTRY
MINNA
MINNESOTA
MINUSMA
MN-JTF
MND
MNJTF
MNTJTF
MOD
MOGADISHU
MONDAY
MONDE
MONEY
MONTPELIER
MONTREAL
MOODY
MOPOL
MOPOL,
MORAV.CHEMIC.
MOROCCAN
MOSAFEJO
MOSCOW
MOZAMBIQUE
MPS
MPs
MRI
MS
MSA
MSK
MSV
MT
MTJF
MTK
MULTINATIONAL
MUZAFFARABAD
Maakinen
Macdonald
Macedonian
Machnee
Machuca
Madachi
Madagali
Madagali,
Madagascar
Madayi,
Madeira
Madobi
Madrid
Maduegbunam.
Mae
Maenmuan
Magaji,
Magdalena
Magnificent
Magnus
Mahmood
Mai'Adua
Mai'adua
Maiduguri
Maiduguri,
Maiduguri-Damaturu
Maiduguri-Damaturu.
Maiduguri-based
Maiduguri.
Maiduguri;
Maiha
Maikobi,
Maimalari
Maina,
Maintenance
Maj
Maj,
Maj-Gen
Maj-Gen.
Maj.
Maj.-
Maj.-Gen
Maj.-Gen.
Majoli
Major
Major,
Major-
Major-Gen.
Major-General
Major-General,
Major-Generals
Major.
Makaranta
Makarov
Makarova
Make
Makinde
Makinen
Making
Makurdi
Makurdi,
Malagara
Malakwen
Malam
Malawi
Malaysia
Malaysian
Malbak
Malcolm
Maleeva
Malekos
Mali
MaliVai
Malik
Malivai
Mallinckrodt
Malta
Maltese
Malumfashi
Mambilla
Mamedov
Mamiit
Mamman,
Man
Man's
Management
Managing
Managua
Manaus
Manchester
Mandawari
Mandsaur
Mangala
Manhattan
Mani
Manila
Manitoba
Manko
Manly
Mansfield
Mantilla
Manuel
Many
Maoist
Maoists
Mapei
Mapo
Mapourdit
Maputo
Maracaibo
Marafa
Marc
Marcel
Marcelo
March
Marchal
Marcin
Marco
Marcos
Marcus
Marek
Margaret
Maria
Mariaan
Mariacarla
Marial
Marianne
Mariner
Mariners
Mario
Marion
Mariri
Maritime
Mariusz
Mark
Market
Marketing
Markets
Marksmanship
Markvart
Marlene
Marlins
Maroko
Maronite
Marrakesh
Marseille
Marshal
Marshal,
Marshall
Martin
Martina
Martinez
Martins
Marty
Martyn
Marushko
Marwa
Marwa,
Marwan
Marxist-Leninist
Mary
Mashadov
Mashi
Maskhadov
Maslova
Masood
Massachusetts
Massira
Master's
Matagalpa
Matahari
Match
Mats
Matt
Matters
Matthew
Maturity
Matusevitch
Matuzici
Maureen
Mauritania
Mauritian
Mauritius
Maurizio
Max
Maxwell
May
Maybe
Mayer
Maynard
Mayo
Mayo-Belwa
Mazzolari
Mba
Mbeki
Mbo
Mbu
Mbu;
McAteer
McCarthy
McCullough
McCurry
McEwen
McGinley
McGrath
McGriff
McKinney
McLeod
McLoughlin
McNeil
McNulty
McRae
Meadows
Meads
Meantime,
Meanwhile,
Mecca
Mechanisd
Mechanised
Mechanized
Mechelen
Medani
Medeghini
Medellin
Media
Mediaset
Medicaid
Medical
Medicare
Medium
Megawati
Meghann
Mehemdagic
Meiran
Meknes
Melanie
Melbourne
Melissa
Members
Men
Menendez
Mental
Mentmore
Mercantile
Mercer
Merchant
Meri
Meri,
Merrion
Mesa
Mess
Messages
Metalurg
Metro
Metropolitan
Mets
Metz
Mexican
Mexico
Mhow
Miami
Michael
Michel
Michele
Michelman
Michika
Michika,
Mick
Middle
Middlesbrough
Middlesex
Midfielders
Midwest
Mieciel
Miguel
Mikael
Mike
Milan
Mile
Military
Military.Secretary,
Miller
Millfeed
Millwall
Milwaukee
Min
Mineiro
Miners
Minimah
Minimah,
Minister
Ministers
Ministry
Minjibir
Minna
Minna,
Minna.
Minneapolis
Minnesota
Mir
Miranda
Mirhunisa
Miriam
Miron
Mironivka
Mironov
Mirren
Misael
Miscellaneous
Mission
Missionaries
Mitchell
Mitsubishi
Mixed
Miyaga
Miyagi
Mo
MoD
MoD--Special
Mobile
Mobility
Mobolaji
Mocude
Moenchengladbach
Mohali
Mohamed
Mohammad
Mohammed
Mohammed,
Mohammed.
Mohammedia
Moin
Moira
Mokola
Molde
Molenbeek
Monday
Monday,
Monday.
Monde
Monetary
Money
Mongolia
Monguno
Monguno,
Monica
Monitoring
Monsignor
Montana
Montenegrin
Montenegro
Monterrey
Montgomerie
Montolio
Montpelier
Montpellier
Montreal
Montrose
Moody
Moore
Mopol
Morariu
More
Morelia
Moreno
Morgan
Moroccan
Morocco
Morogbo
Morris
Morton
Mosafejo
Moscow
Moses
Moshood,
Moskal
Moslem
Moslem-Croat
Moslem-led
Moslems
Moss
Most
Mostostal
Mother
Motherwell
Motorised
Motorized
Motorola
Moundhey
Mountains
Moura
Mouscron
Moussa
Movement
Movladi
Mowe
Moxon
Moya
Mozambican
Mozambique
Mpumulanga
Mr
Mr.
Mrs
Mrs.
Muasher
Muazu
Muazu,
Mubi
Muhammad
Muhammadu
Mujtaba
Mullally
Muller
Multi
Multi-National
Multi-layers
Multi-national
Multidimensional
Multinational
Mungono,
Mungonu,
Munguno,
Munich
Municipal
Munk
Muraina
Muralidaran
Muratovic
Murray
Musa
Musa,
Musawa
Museeuw
Museum
Mushtaq
Mustapha
Mustapha,
Muster
Muzaffarabad
N
N.
N.C.
N.J.
N/A
N1
NA
NA,
NAC
NADC
NAF
NAF,
NAFH
NAFHC
NAIROBI
NAME
NAN
NAPKC
NAPKC,
NASDAQ
NATIONAL
NATIONS
NATO
NATO-led
NAVAL
NAVTRAC
NAVY
NAVY,
NAVY/SPECIAL
NDAC
NDC
NE
NEC
NEED
NEMA
NET
NETHERLANDS
NEUCHATEL
NEUFCHATEAU
NEW
NEWPORT
NEWS
NGIERIAN
NGO
NI
NIBATT
NIC
NIDA'A
NIG.
NIGER
NIGERAIN
NIGERIA
NIGERIA,
NIGERIAN
NIGERINA
NIMASA
NIMED
NINE
NINE-MONTH
NINTH
NL
NND
NNHL
NNS
NNSY
NNTO
NO.BATTALION
NOD
NORTH
NORTHAMPTON
NORWAY
NOTE
NOTES
NOTICIAS
NOVYE
NPF
NSS
NTV
NWAMBA
NWE
NYC
NYMEX
NYSC,
NZ
NZ$
NZPA
Nabawa
Naberezhnye
Nadarajah
Nagatsuka
Nagy
Nagyova
Naibawa
Naina
Nairobi
Nakanda
Nalkhera
Name
Namibia
Nana
Nanda
Nangere
Nansel
Naoko
Naoto
Narciso
Nasarawa
Nasdaq
Nassarawa
Nasser
Nastase
Nastja
Natalia
Natalya
Natasha
Nathalie
National
Nationalist
Nationalists
Nations
Naval
Navjot
Navy
Navy,
Navy/Special
Nazir,
Ndalolo,
Ndiegoro
Ndiomu,
Neamt
Nearly
Necaxa
Necmettin
Nederland
Neemuch
Neiland
Neither
Nelson
Nepal
Nepali
Net
Netanyahu
Netherlands
Neths
Neuchatel
Neville
New
Newbury
Newcastle
Newell
Newlove
News
Newsdesk
Newspaper
Newspapers
Newsroom
Newt
Next
Neza
Nganzai
Ngonadi,
Ngubane
Ngubane,
Ngurore
Ngwa
Nhamavila
Niall
Nicaragua
Nicaraguan
Nicaretta
Nicholas
Nicholas,
Nicholas.
Nick
Nickel
Nicklas
Nicola
Nicolas
Nicole
Nienge
Niger
Niger,
Nigerain
Nigeria
Nigeria,
Nigeria.
Nigeria:
NigeriaN
Nigerian
Nigerians
Nigerians.
Nigeria’s
Nijmegen
Nike
Nikkei
Nilis
Nimbo,
Ning
Ningi
Ningi.
Ninova
Ninth
Nirmal
Nitra
Nizhny
Nnaji,
Nnamdi
Nnewi
Nnobi
Nnobi,
Nnwei
No
No-one
No1
No2
Nobel
Nobilo
Noble
Noman's
Nomura
Non-Callable
Non-Commissioned
None
Nor
Nora,
Noranda
Normans-land
Norris
North
North-East.
Northampton
Northamptonshire
Northcote
Northeast,
Northern
Northfield
Norway
Norwegian
Norwich
Not
Note
Noticias
Noting
Notting
Nottingham
Nottinghamshire
Notts
Nouakchott
Nov.
NovDec
Novak
November
Novgorod
Novorossiisk
Novotna
Novye
Now
Nsit
Nsukka
Ntomchukwu
Nuclear
Nuevo
Nuhu
Nuku'alofa
Numan
Nuour
Nursing
Nutricia
Nvisited
Nwachukwu,
Nwamba
Nwanguna,
Nwaoga,
Nwaoga.
Nwaogbo
Nwaogbo,
Nwodibo
Nwoga
Nwogbo,
Nyva
Nzam
N’Djamena,
O
O'Brien
O'Leary
O'Neal
O'Neill
O-157
O.
O.A
O.O
O/C
OAKLAND
OB
OC
OCASEK
OCTOBER
OE
OF
OFF
