{"text": "Nigeria to deploy 700 soldiers for Peace Keeping Operations in Liberia- Army\n\nThe Army recently withdrew several soldiers from foreign operations because of domestic duties.\n\nThe Nigerian Army will deploy 700 soldiers for Peace Support Operation in Liberia, a military official has said.\n\nThe Commandant, Nigeria Army Peacekeeping Centre, Major General Salihu Uba, said this on Friday in Kaduna.\n\nMr. Uba said that the personnel, drawn from the 22 Battalion, would serve for six months. He said this at the end of the pre-deployment training conducted for the soldiers at the centre in Jaji, Kaduna State. He commended them for their professionalism, and urged them to be good ambassadors of Nigeria.\n\nThe commandant assured that the centre would continue to expand its facilities “to provide first class training to troops and participants”.\n\n“The vision of the Nigerian Army peacekeeping centre is to deliver realistic training to potential peacekeepers for the multidimensional challenges of contemporary peace support operations,” he stated.\n\nMr. Uba added that the centre had been discharging its role creditably, which earned it a certificate of recognition from the United Nations, as Centre of Excellence.\n\nThe General Officer Commanding 2 Division, Major General Ahmad Jibrin, charged the soldiers to be focused, professional and efficient in discharging their mandate.\n\nMr. Jibrin, represented by Brigadier General Johnson Oladende, warned them against involvement in drug trafficking and disrespecting the culture of their host country.\n\nHe assured that the army would continue to live up to expectations in safeguarding world peace.\n\nThe Nigerian Army recently withdrew several hundreds of soldiers in peace keeping operations in foreign countries so as to have more personnel to fight the Boko Haram insurgency in Northern Nigeria and the increased crude oil theft in the Niger Delta.\n", "entities": [["T6", "Person", [[353, 363]]], ["T13", "Person", [[1272, 1284]]], ["T15", "Person", [[1425, 1441]]], ["T1", "Organization", [[35, 76]]], ["T2", "Organization", [[179, 192]]], ["T3", "Organization", [[222, 245]]], ["T4", "Organization", [[305, 337]]], ["T5", "Rank", [[339, 352]]], ["T7", "Organization", [[445, 457]]], ["T8", "Organization", [[863, 876]]], ["T9", "Organization", [[1173, 1212]]], ["T10", "Title_Role", [[1219, 1245]]], ["T11", "Organization", [[1246, 1256]]], ["T12", "Rank", [[1258, 1271]]], ["T14", "Rank", [[1407, 1424]]], ["T16", "Organization", [[1650, 1663]]], ["T17", "Location", [[1827, 1835]]]], "relations": [["R1", "is_posted", [["Person", "T6"], ["Organization", "T4"]]], ["R2", "has_rank", [["Person", "T6"], ["Rank", "T5"]]], ["R3", "has_title_or_role", [["Person", "T13"], ["Title_Role", "T10"]]], ["R4", "is_posted", [["Person", "T13"], ["Organization", "T11"]]], ["R5", "has_rank", [["Person", "T13"], ["Rank", "T12"]]], ["R6", "has_rank", [["Person", "T15"], ["Rank", "T14"]]]]}